src/cf/InformationRegisters/DeleteAccessValuesGroups.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>DeleteAccessValuesGroups</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>InheritParentRights</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>AccessKind</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.DeleteAccessKinds</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccessValue</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccessKindOnly</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AccessValuesGroup</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>GroupOfDataToUpdate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ObjectRightsSettingsInheritance.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ObjectRightsSettingsInheritance</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Inherit</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>UsageLevel</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RightsSettingsOwner</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Parent</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RightsSettingsOwner</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/DeleteAccessValuesGroups/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

// The infobase update handler.
Procedure MoveDataToNewRegister() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	TRUE AS TrueValue
	|FROM
	|	InformationRegister.DeleteAccessValuesGroups AS DeleteAccessValuesGroups";
	
	If Query.Execute().IsEmpty() Then
		Return;
	EndIf;
	
	Query.SetParameter("OwnersTypes",
		AccessManagementInternalCached.RightsForObjectsRightsSettingsAvailable().OwnersTypes);
	
	Query.Text =
	"SELECT
	|	DeleteAccessValuesGroups.AccessValue AS Object,
	|	DeleteAccessValuesGroups.AccessValuesGroup AS Parent,
	|	DeleteAccessValuesGroups.InheritParentRights AS Inherit
	|FROM
	|	InformationRegister.DeleteAccessValuesGroups AS DeleteAccessValuesGroups
	|		INNER JOIN Catalog.MetadataObjectIDs AS MetadataObjectIDs
	|		ON (DeleteAccessValuesGroups.AccessValue = DeleteAccessValuesGroups.AccessValuesGroup)
	|			AND (DeleteAccessValuesGroups.InheritParentRights = FALSE)
	|			AND (VALUETYPE(DeleteAccessValuesGroups.AccessValue) = VALUETYPE(MetadataObjectIDs.EmptyRefValue))
	|			AND (MetadataObjectIDs.EmptyRefValue IN (&OwnersTypes))";
	
	BeginTransaction();
	Try
		QueryResult = Query.Execute();
		
		If Not QueryResult.IsEmpty() Then
			RecordSet = InformationRegisters.ObjectRightsSettingsInheritance.CreateRecordSet();
			RecordSet.Load(QueryResult.Unload());
			RecordSet.Write();
		EndIf;
		
		RecordSet = CreateRecordSet();
		RecordSet.Write();
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndProcedure

// The infobase update handler.
Procedure ClearRegister() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	TRUE AS TrueValue
	|FROM
	|	InformationRegister.DeleteAccessValuesGroups AS DeleteAccessValuesGroups";
	
	If Query.Execute().IsEmpty() Then
		Return;
	EndIf;
	
	RecordSet = CreateRecordSet();
	RecordSet.Write();
	
EndProcedure

#EndRegion

#EndIf
